src/InformationRegisters/ПродуктыКПроектам/ПродуктыКПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПродуктыКПроектам</name>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИДПродукта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПродуктыКПроектам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Функция ПроектПоПродукту(ИДПродукта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродуктыКПроектам.Проект КАК Проект
	|ИЗ
	|	РегистрСведений.ПродуктыКПроектам КАК ПродуктыКПроектам
	|ГДЕ
	|	ПродуктыКПроектам.ИДПродукта = &ИДПродукта";
	
	Запрос.УстановитьПараметр("ИДПродукта", ИДПродукта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Проект;	
	КонецЕсли;
	
	Возврат Справочники.Проекты.Неопределен;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
